app/controllers/products_controller.rb

INSERT INTO `products` (`amount`, `created_at`, `description`, `name`, `status`, `updated_at`) VALUES (1.0, '2014-10-05 19:59:27', 'des', 'Moto', 'Available', '2014-10-05 19:59:27')
---
  def create
    @product = Product.new(product_params)
    @product.save

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1 LIMIT 1
---
  def edit
    @product = Product.find(1)

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1 LIMIT 1
UPDATE `products` SET `description` = 'des asa', `name` = 'Moto X', `updated_at` = '2014-10-05 20:20:08' WHERE `products`.`id` = 1
---
  def update
    @product = Product.find(1)
    @product.update_attributes(product_params)

SELECT  `products`.* FROM `products`  WHERE `products`.`id` = 1 LIMIT 1
DELETE FROM `products` WHERE `products`.`id` = 1
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy